saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_KLxx_DFP.1.15.0.pdsc
          <book name="Documents/KL24P80M48SF0RM.pdf" title="KL24 Sub-Family Reference Manual"/>
          <book name="Documents/KL24P80M48SF0.pdf"   title="KL24 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL24Z64xxx4  ****************************** -->
        <device Dname="MKL24Z64xxx4">
          <compile header="Device/Include/MKL24Z4.h" define="MKL24Z64xxx4"/>
          <debug svd="SVD/MKL24Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL24P80M48SF0RM.pdf" title="KL24 Sub-Family Reference Manual"/>
          <book name="Documents/KL24P80M48SF0.pdf"   title="KL24 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL25Z32xxx4  ****************************** -->
        <device Dname="MKL25Z32xxx4">
          <compile header="Device/Include/MKL25Z4.h" define="MKL25Z32xxx4"/>
          <debug svd="SVD/MKL25Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents/KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL25Z64xxx4  ****************************** -->
        <device Dname="MKL25Z64xxx4">
          <compile header="Device/Include/MKL25Z4.h" define="MKL25Z64xxx4"/>
          <debug svd="SVD/MKL25Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents/KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL25Z128xxx4  ****************************** -->
        <device Dname="MKL25Z128xxx4">
          <compile header="Device/Include/MKL25Z4.h" define="MKL25Z128xxx4"/>
          <debug svd="SVD/MKL25Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x00004000" default="1"/>

          <book name="Documents/KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents/KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z32xxx4  ****************************** -->
        <device Dname="MKL26Z32xxx4">
          <compile header="Device/Include/MKL26Z4.h" define="MKL26Z32xxx4"/>
          <debug svd="SVD/MKL26Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents/KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z64xxx4  ****************************** -->
        <device Dname="MKL26Z64xxx4">
          <compile header="Device/Include/MKL26Z4.h" define="MKL26Z64xxx4"/>
          <debug svd="SVD/MKL26Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents/KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

      </subFamily>

      <!-- ******************************  KL4x    ****************************** -->
      <subFamily DsubFamily="KL4x">
        <description>
The Kinetis KL4x MCU family combines ultra-low-power performance with a rich suite of analog, communication, timing and control peripherals (including a segment LCD controller) for applications like electronic scales, flow meters, smart meters, and thermostats.
 - Includes multiple flexible low-power modes, including new compute mode which reduces dynamic power by placing peripherals in an asynchronous stop mode
 - Features security circuitry to prevent unauthorized access to RAM and flash contents
 - Provides a migration path to lower and higher performance and feature integration through compatibility with other Kinetis families
 - Backed by robust development tools and software
        </description>

        <!-- ******************************  MKL43Z64xxx4  ****************************** -->
        <device Dname="MKL43Z64xxx4">
          <compile header="Device/Include/MKL43Z4.h" define="MKL43Z64xxx4"/>
          <debug svd="SVD/MKL43Z4.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ_KL43.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

          <book name="Documents/KL43P64M48SF6RM.pdf" title="KL43 Sub-Family Reference Manual"/>
          <book name="Documents/KL43P64M48SF6.pdf"   title="KL43 Sub-Family Data Sheet"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- ******************************  KL0x    ****************************** -->
    <condition id="MKL04Z4 CMSIS">
      <description>NXP Kinetis KL04 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL04Z16xxx4"/>
      <accept Dname="MKL04Z32xxx4"/>
      <accept Dname="MKL04Z8xxx4"/>
    </condition>
