saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_KLxx_DFP.1.15.0.pdsc
  <boards>
    <board name="FRDM-KL25Z" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL25Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <description>The FRDM-KL25Z is a Freedom Development Platform for Kinetis KL14, KL15, KL24, KL25 MCUs.</description>
      <image small="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_small.jpg"
             large="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-kl14-kl15-kl24-kl25-mcus:FRDM-KL25Z" title="FRDM-KL25Z Web Page"/>
      <book category="manual"    name="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_UM.pdf"   title="User Manual"/>
      <book category="setup"     name="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_QSG.pdf"  title="Quick Start Guide"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="CR2032 Battery"/>
      <feature type="Button"    n="1"              name="Reset button"/>
      <feature type="USB"       n="1"              name="Full-Speed USB OTG with USB Standard-B Connector"/>
      <feature type="DIO"       n="76"             name="Arduino R3 compatible I/O connectors"/>
      <feature type="LED"       n="1"              name="Tri-color (RGB) LED"/>
      <feature type="Touch"     n="1"              name="Capacitive Touch Slider"/>
      <feature type="Accelerometer" n="1"          name="MMA8451Q 3-axis digital Accelerometer"/>
      <feature type="FreedomFF"/>
      <debugInterface adapter="OpenSDA"   connector="Mini-USB"/>
    </board>
  </boards>

  <examples>
    <!-- FRDM-KL25Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KL25Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL25Z" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
